laction/frontend/modules/booking/models/Booking.php

    public static function createAudition($arrInputs)
    {
        $intInsert = Yii::$app->db->createCommand()
            ->batchInsert('bookings', [
            'category_type',
            'booking_type',
            'booking_no',
            'customer_id',
            'fullname',
            'email',
            'phone',
            'gender',
            'sub_category_id',
            'age',
            'event_date',
            'from_time',
            'to_time',
            'extra_minutes',
            'booking_status',
            'created_date',
            'created_by'
        ], $arrInputs)
            ->execute();
---
INSERT INTO `bookings` (`category_type`, `booking_type`, `booking_no`, `customer_id`, `fullname`, `email`, `phone`, `gender`, `sub_category_id`, `age`, `film_type`, `film_name`, `film_censor`, `event_date`, `from_time`, `to_time`, `extra_minutes`, `booking_status`, `created_date`, `created_by`) VALUES ('preview', 'dummyorder', 'LP616718', '10', 'jamuna', 'jamuna@gmail.com', '0000000000', NULL, NULL, NULL, 'featured', 'asdfasdfasdf', 'none', '2018-02-25', '20:08:00', '22:08:00', NULL, 'inprogress', '2018-05-23 23:27:05', '10'), ('preview', 'dummyorder', 'LP616718', '10', 'jamuna', 'jamuna@gmail.com', '0000000000', NULL, NULL, NULL, 'featured', 'asdfasdfasdf', 'none', '2018-02-25', '20:29:00', '22:29:00', NULL, 'inprogress', '2018-05-23 23:27:05', '10')