laction/frontend/modules/booking/models/SubCategories.php

SELECT `s`.`category_name`, `s`.`name`, `s`.`id` AS `sub_category_id` FROM `subcategories` `s` WHERE s.category_name='actor'
---
    public static function getSubCategories($arrInputs = [])
    {
        $objQuery = new Query();
        $objQuery->select([
            's.category_name',
            's.name',
            's.id as sub_category_id'
        ]);
        $objQuery->from('subcategories as s');
        if (isset($arrInputs['category']) && ! empty($arrInputs['category'])) {
            $objQuery->andWhere('s.category_name=:category', [
                ':category' => $arrInputs['category']
            ]);
        }
        $arrResponse = $objQuery->all(self::getDb());