laction/frontend/modules/customers/models/Customers.php

UPDATE `customer` SET `fb_link`='', `google_plus_link`='', `instagram_link`='', `linkedin_link`='', `twitter_link`='', `id`='10' WHERE `id`='10'
---
    public static function updateCustomer($arrInputs, $arrWhere) {
        $objConnection = Yii::$app->db;
        $intUpdate = $objConnection->createCommand()
                ->update('customer', $arrInputs, $arrWhere)
                ->execute();