laction/backend/modules/users/models/Users.php

    public static function updateUser($arrInputs, $arrWhere)
    {
        $objConnection = Yii::$app->db;
        $intUpdate = $objConnection->createCommand()
            ->update('users', $arrInputs, $arrWhere)
            ->execute();
---
UPDATE `users` SET `id`=1, `password`='$2y$13$KLOzzGFpBEjEVlt8ZEq4cuTcdo6ecODBoVhQyqHBCpLBV9QnKwa6q', `last_modified_by`=NULL WHERE `id`='1'