laction/backend/modules/slots/models/Categories.php

SELECT `c`.`id` AS `category_id`, `c`.`name`, `c`.`status` FROM `categories` `c`
---
    public static function getCategories($arrInputs = [])
    {
        $objQuery = new Query();
        $objQuery->select([
            'c.id as category_id',
            'c.name',
            'c.status'
        ]);
        $objQuery->from('categories as c');
        // Category Id
        if (isset($arrInputs['category_id']) && ! empty($arrInputs['category_id'])) {
            $objQuery = $objQuery->andWhere('c.id=:categoryId', [
                ':categoryId' => $arrInputs['category_id']
            ]);
        }
        // Name
        if (isset($arrInputs['name']) && ! empty($arrInputs['name'])) {
            $objQuery = $objQuery->andWhere('c.name=:categoryName', [
                ':categoryName' => $arrInputs['name']
            ]);
        }
        // Id
        if (isset($arrInputs['id']) && ! empty($arrInputs['id'])) {
            $objQuery = $objQuery->andWhere('c.id!=:Id', [
                ':Id' => $arrInputs['id']
            ]);
        }
        $arrResponse = $objQuery->all();