laction/backend/modules/slots/models/SubCategories.php

UPDATE `subcategories` SET `id`=5, `category_name`='action', `name`='rubber', `status`='active' WHERE `id`='5'
---
    public static function updateSubCategory($arrInputs, $arrWhere)
    {
        $objConnection = Yii::$app->db;
        $intUpdate = $objConnection->createCommand()
            ->update('subcategories', $arrInputs, $arrWhere)
            ->execute();